src/Enums/ТипыПодключаемогоОборудования/ТипыПодключаемогоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПодключаемогоОборудования</name>
  <enumValues>
    <name>СканерШтрихкода</name>
    <comment>Scanner</comment>
  </enumValues>
  <enumValues>
    <name>СчитывательМагнитныхКарт</name>
    <comment>MSR</comment>
  </enumValues>
  <enumValues>
    <name>ФискальныйРегистратор</name>
    <comment>FiscalPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЧеков</name>
    <comment>ReceiptPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ДисплейПокупателя</name>
    <comment>LineDisplay</comment>
  </enumValues>
  <enumValues>
    <name>ТерминалСбораДанных</name>
    <comment>DataCollectionTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭквайринговыйТерминал</name>
    <comment>AcquiringTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеВесы</name>
    <comment>Scale</comment>
  </enumValues>
  <enumValues>
    <name>ВесыСПечатьюЭтикеток</name>
    <comment>ScaleOffline</comment>
  </enumValues>
  <enumValues>
    <name>УдалитьККМОфлайн</name>
    <comment>ECROffline</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЭтикеток</name>
    <comment>LabelPrinter</comment>
  </enumValues>
  <enumValues>
    <name>СчитывательRFID</name>
    <comment>RFID</comment>
  </enumValues>
  <enumValues>
    <name>УстройствоРаспознавания</name>
  </enumValues>
  <enumValues>
    <name>ККТ</name>
    <comment>KKT</comment>
  </enumValues>
  <enumValues>
    <name>ОблачнаяККТ</name>
  </enumValues>
  <enumValues>
    <name>Несертифицируемое</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/МенеджерОборудованияПовтИсп/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция СодержимоеОбщегоМакета(Знач ИмяМакета) Экспорт

	СодержимоеМакета = ПолучитьОбщийМакет(ИмяМакета).ПолучитьТекст();     
	Возврат СодержимоеМакета; 
	
КонецФункции

Функция СовместимостьВнешнейКомпонентыИзФайла(Знач ИмяМакета) Экспорт
	
	ВремИмяМакета = СтрРазделить(ИмяМакета,".", Ложь);
	ВремИмяМакета = ВремИмяМакета[ВремИмяМакета.ВГраница()];
	ДвоичныеДанные = ПолучитьОбщийМакет(ВремИмяМакета);
		
	Результат = ВнешниеКомпонентыБПО.ИнформацияОКомпонентеИзФайла(ДвоичныеДанные, Ложь);
	Если Результат.Разобрано Тогда
		Возврат Результат.Реквизиты;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПоставляемыеДрайверы() Экспорт
	
	МодулиОбновления = Новый Массив();
	Если ОбщегоНазначенияБПО.ИспользуетсяУстройстваВвода() Тогда
		МодулиОбновления.Добавить(ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеУстройстваВвода"));       
	КонецЕсли;
	Если ОбщегоНазначенияБПО.ИспользуетсяЧекопечатающиеУстройства() Тогда
		МодулиОбновления.Добавить(ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройства"));       
	КонецЕсли;
	Если ОбщегоНазначенияБПО.ИспользуетсяПлатежныеСистемы() Тогда
		МодулиОбновления.Добавить(ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеПлатежныеСистемы"));       
	КонецЕсли;          
	Если ОбщегоНазначенияБПО.ИспользуетсяДисплеиПокупателя() Тогда
		МодулиОбновления.Добавить(ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеДисплеиПокупателя"));       
	КонецЕсли;
	Если ОбщегоНазначенияБПО.ИспользуетсяВесовоеОборудование() Тогда
		МодулиОбновления.Добавить(ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеВесовоеОборудование"));       
	КонецЕсли;                          
// ++ НеМобильноеПриложение
	Если ОбщегоНазначенияБПО.ИспользуетсяТерминалыСбораДанных() Тогда
		МодулиОбновления.Добавить(ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеТерминалыСбораДанных"));       
	КонецЕсли;
	Если ОбщегоНазначенияБПО.ИспользуетсяПринтерыЭтикеток() Тогда
		МодулиОбновления.Добавить(ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеПринтерыЭтикеток"));       
	КонецЕсли;
	Если ОбщегоНазначенияБПО.ИспользуетсяСчитывательRFID() Тогда
		МодулиОбновления.Добавить(ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеСчитывательRFID"));       
	КонецЕсли;
	Если ОбщегоНазначенияБПО.ИспользуетсяУстройствоРаспознавания() Тогда
		МодулиОбновления.Добавить(ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеУстройствоРаспознавания"));       
	КонецЕсли;
	Если ОбщегоНазначенияБПО.ИспользуютсяОблачныеККТ() Тогда
		МодулиОбновления.Добавить(ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеОблачныеККТ"));       
	КонецЕсли;
// -- НеМобильноеПриложение
	ДрайверыОборудования = МенеджерОборудования.НоваяТаблицаПоставляемыхДрайверовОборудования();
	Для Каждого МодульОбновления Из МодулиОбновления Цикл
		МодульОбновления.ОбновитьПоставляемыеДрайвера(ДрайверыОборудования);
	КонецЦикла;
	
	Возврат ДрайверыОборудования;
	
КонецФункции

Функция ИдентификаторыДрайверов() Экспорт
	
	ДрайверыОборудования = ПоставляемыеДрайверы();
	
	ДрайверыОборудования.Свернуть("ИдентификаторОбъекта, СнятСПоддержки");
	Результат = Новый Массив();
	Для каждого Элемент Из ДрайверыОборудования Цикл
		Если Не Элемент.СнятСПоддержки Тогда
			Результат.Добавить(Элемент.ИдентификаторОбъекта);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрыТипыОборудования() Экспорт
	
	Результат = Новый Структура();
	ДоступныеТипы = ДоступныеТипыОборудования(Истина);
	Для каждого Значение Из ДоступныеТипы Цикл
		
		ИмяЗначения = ОбщегоНазначенияБПО.ИмяЗначенияПеречисления(Значение);
		Результат.Вставить(ИмяЗначения, Ложь);
		
	КонецЦикла;
	
	// Дополнение типов оборудования
	Результат.Вставить("ФискальныйРегистратор", Ложь);
	
	Возврат Результат;

КонецФункции

// Получить соответствие типов оборудования
//
// Возвращаемое значение:
//   Соответствие -
//
Функция СоответствиеТиповОборудования() Экспорт
	
	Соответствие = Новый Соответствие();
	
	ДоступныеТипы = ДоступныеТипыОборудования(Истина);
	Для каждого Значение Из ДоступныеТипы Цикл
		
		ИмяЗначения = ОбщегоНазначенияБПО.ИмяЗначенияПеречисления(Значение);
		Соответствие.Вставить(ИмяЗначения, Значение);
		
	КонецЦикла;
	
	// Russian alphabet. Не локализовывать
	Соответствие.Вставить("УстройствоВвода"       , Перечисления.ТипыПодключаемогоОборудования.СканерШтрихкода); //@NON-NLS-1 @NON-NLS-2   
	
	// English alphabet. 
	Соответствие.Вставить("BarcodeScanner"        , Перечисления.ТипыПодключаемогоОборудования.СканерШтрихкода); //@NON-NLS-1 @NON-NLS-2      
	Соответствие.Вставить("CardReader"            , Перечисления.ТипыПодключаемогоОборудования.СчитывательМагнитныхКарт); //@NON-NLS-1 @NON-NLS-2   
	Соответствие.Вставить("KKT"                   , Перечисления.ТипыПодключаемогоОборудования.ККТ); //@NON-NLS-1 @NON-NLS-2    
	Соответствие.Вставить("FiscalRegistrar"       , Перечисления.ТипыПодключаемогоОборудования.ФискальныйРегистратор); //@NON-NLS-1 @NON-NLS-2   
	Соответствие.Вставить("ReceiptPrinter"        , Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков); //@NON-NLS-1 @NON-NLS-2   
	Соответствие.Вставить("CustomerDisplay"       , Перечисления.ТипыПодключаемогоОборудования.ДисплейПокупателя); //@NON-NLS-1 @NON-NLS-2   
	Соответствие.Вставить("DataCollectionTerminal", Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных); //@NON-NLS-1 @NON-NLS-2   
	Соответствие.Вставить("POSTerminal"           , Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал); //@NON-NLS-1 @NON-NLS-2   
	Соответствие.Вставить("WeighingScales"        , Перечисления.ТипыПодключаемогоОборудования.ЭлектронныеВесы); //@NON-NLS-1 @NON-NLS-2   
	Соответствие.Вставить("LabelPrintingScale"    , Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток); //@NON-NLS-1 @NON-NLS-2   
	Соответствие.Вставить("LabelPrinter"          , Перечисления.ТипыПодключаемогоОборудования.ПринтерЭтикеток); //@NON-NLS-1 @NON-NLS-2   
	Соответствие.Вставить("RFIDReader"            , Перечисления.ТипыПодключаемогоОборудования.СчитывательRFID); //@NON-NLS-1 @NON-NLS-2    
	Соответствие.Вставить("Recognizer"            , Перечисления.ТипыПодключаемогоОборудования.УстройствоРаспознавания); //@NON-NLS-1 @NON-NLS-2       
	
	Возврат Соответствие;
	
КонецФункции

// Возвращает список доступных типов оборудования.
//
// Параметры:
//  ВключаяНеиспользуемые - Булево - по умолчанию Ложь, добавить неиспользуемые типы, для совместимости
// 
// Возвращаемое значение:
//   Массив из ПеречислениеСсылка.ТипыПодключаемогоОборудования - Массив доступных типов подключаемого оборудования в конфигурации.
//
Функция ДоступныеТипыОборудования(ВключаяНеиспользуемые = Ложь) Экспорт
	
	СписокТиповОборудования = Новый Массив;
	СтандартнаяОбработка = Истина;
	
	МенеджерОборудованияВызовСервераПереопределяемый.ДоступныеТипыОборудования(СписокТиповОборудования, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		СписокТиповОборудования.Очистить();
		Если ОбщегоНазначенияБПО.ИспользуетсяУстройстваВвода() Тогда
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.СканерШтрихкода);
		// ++ НеМобильноеПриложение
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.СчитывательМагнитныхКарт);
		// -- НеМобильноеПриложение     
		КонецЕсли;
		Если ОбщегоНазначенияБПО.ИспользуетсяЧекопечатающиеУстройства() Тогда
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ККТ);
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков);
			Если ВключаяНеиспользуемые Тогда
				СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ФискальныйРегистратор);
			КонецЕсли;
		КонецЕсли;
		Если ОбщегоНазначенияБПО.ИспользуетсяДисплеиПокупателя() Тогда
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ДисплейПокупателя);
		КонецЕсли;
		// ++ НеМобильноеПриложение
		Если ОбщегоНазначенияБПО.ИспользуетсяТерминалыСбораДанных() Тогда
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных);
		КонецЕсли;
		// -- НеМобильноеПриложение     
		Если ОбщегоНазначенияБПО.ИспользуетсяПлатежныеСистемы() Тогда
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал);
		КонецЕсли;
		Если ОбщегоНазначенияБПО.ИспользуетсяВесовоеОборудование() Тогда
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ЭлектронныеВесы);  
		// ++ НеМобильноеПриложение
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток);
		// -- НеМобильноеПриложение     
		КонецЕсли;
		// ++ НеМобильноеПриложение
		Если ОбщегоНазначенияБПО.ИспользуетсяПринтерыЭтикеток() Тогда
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ПринтерЭтикеток);
		КонецЕсли;
		Если ОбщегоНазначенияБПО.ИспользуетсяСчитывательRFID() Тогда
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.СчитывательRFID);
		КонецЕсли;
		Если ОбщегоНазначенияБПО.ИспользуетсяУстройствоРаспознавания() Тогда
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.УстройствоРаспознавания);
		КонецЕсли;
		Если ОбщегоНазначенияБПО.ИспользуютсяОблачныеККТ() Тогда
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ОблачнаяККТ);
		КонецЕсли;
		
		Если ОбщегоНазначенияБПО.ИспользуетсяНесертифицированноеОборудование() Тогда
			МодульОборудованиеНесертифицированное = ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеНесертифицированное");
			Если ВключаяНеиспользуемые Или МодульОборудованиеНесертифицированное.ДоступноНесертифицированноеОборудование() Тогда
				ТипыОборудования = МенеджерОборудования.ДоступныеТипыНесертифицированногоОборудования();
				Для Каждого Элемент Из ТипыОборудования Цикл
					СписокТиповОборудования.Добавить(Элемент);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		// -- НеМобильноеПриложение     
	КонецЕсли;
	
	// ++ НеМобильноеПриложение
	УдалитьККМОфлайн = СписокТиповОборудования.Найти(Перечисления.ТипыПодключаемогоОборудования.УдалитьККМОфлайн);
	Если УдалитьККМОфлайн <> Неопределено Тогда
		СписокТиповОборудования.Удалить(УдалитьККМОфлайн);
	КонецЕсли;
	
	// -- НеМобильноеПриложение     
	Возврат СписокТиповОборудования;
	
КонецФункции


#КонецОбласти

#КонецЕсли
